Repository: curiosity110/mico
Catalog: locale/*/LC_MESSAGES/django.po
Languages: mk

source: Quality products, fast delivery.
mk: Квалитетни производи, брза достава.

source: Cash on delivery across the country. 7-day easy returns.
mk: Плаќање при достава низ целата држава. Лесен поврат за 7 дена.

source: Browse products
mk: Прелистај производи

source: Call us: +389 70 000 000
mk: Јавете се: +389 70 000 000

source: Cash on Delivery
mk: Плаќање при достава

source: Fast delivery (1–3 days)
mk: Брза достава (1–3 дена)

source: 7-day return policy
mk: Политика на враќање за 7 дена

source: Verified supplier
mk: Проверен добавувач

source: Featured products
mk: Избрани производи

source: View all
mk: Види сите

source: All products
mk: Сите производи

source: Products
mk: Производи

source: Contact
mk: Контакт

source: Name
mk: Име

source: Email
mk: Е-пошта

source: Message
mk: Порака

source: Send
mk: Испрати

source: We deliver what you need, when you need it.
mk: Испорачуваме што ви треба, кога ви треба.

source: Example Street
mk: Пример улица

source: Useful links
mk: Корисни врски

source: Privacy Policy
mk: Политика за приватност

source: Terms & Conditions
mk: Услови и одредби

source: All rights reserved
mk: Сите права задржани

source: COD available
mk: Плаќање при достава

source: Ships in 24h
mk: Испорака за 24ч

source: In stock
mk: На залиха

source: Out of stock
mk: Нема залиха

source: View details
mk: Детали

source: Home
mk: Почетна

source: FAQ
mk: Прашања и одговори

source: Search
mk: Пребарај

source: Our Products
mk: Наши производи

source: About Us
mk: За нас

source: Contact Us
mk: Контакт

source: Development
mk: Развој

source: Our experience with orders and clients grows every day.
mk: Нашето искуство со нарачки и клиенти расте секој ден.

source: How do I place an order?
mk: Како да направам нарачка?

source: Select a product and follow the checkout instructions.
mk: Изберете производ и следете ги упатствата за нарачка.

source: What payment methods are available?
mk: Кои начини на плаќање се достапни?

source: We currently offer cash on delivery.
mk: Моментално нудиме плаќање при достава.

source: Certificates & Compliance
mk: Сертификати и усогласеност
